# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
   s: [0.33, 0.50, 1024]


# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Silence, []]       # 0
  - [-1, 1, Preprocess, []]    # 1
  # Two Stream
  ######### TransformerBlock One #############
  # stream one
  - [0, 1, Conv, [32, 3, 2]]   # 2
  - [-1, 1, Conv, [128, 3, 2]] # 3
  - [-1, 3, C2f, [128, True]]  # 4
  # stream two
  - [1, 1, Conv, [32, 3, 2]]   # 5
  - [-1, 1, Conv, [128, 3, 2]] # 6
  - [-1, 3, C2f, [128, True]]  # 7
  # transformer fusion
  - [[4,7], 1, DSFFM, [256]]   # 8
  - [[4,8], 1, Add2, [256,0]]  # 9
  - [[7,8], 1, Add2, [256,1]]  # 10

  ######### TransformerBlock Two #############
  # stream one
  - [9, 1, Conv, [256, 3, 2]]  # 11
  - [-1, 6, C2f, [256, True]]  # 12
  # stream two
  - [10, 1, Conv, [256, 3, 2]] # 13
  - [-1, 6, C2f, [256, True]]  # 14
  # transformer fusion
  - [[12,14], 1, DSFFM, [256]]   # 15
  - [[12,15], 1, Add2, [256,0]]  # 16
  - [[14,15], 1, Add2, [256,1]]  # 17

  ######### TransformerBlock Three #############
  # stream one
  - [16, 1, Conv, [512, 3, 2]]   # 18
  - [-1, 6, C2f, [512, True]]    # 19
  # stream two
  - [17, 1, Conv, [512, 3, 2]]   # 20
  - [-1, 6, C2f, [512, True]]    # 21
  # transformer fusion
  - [[19,21], 1, DSFFM, [512]]   # 22
  - [[19,22], 1, Add2, [512,0]]  # 23
  - [[21,22], 1, Add2, [512,1]]  # 24

  ######### TransformerBlock Four #############
  # stream one
  - [23, 1, Conv, [1024, 3, 2]]    # 25
  - [-1, 3, C2f, [1024, True]]     # 26
  - [-1, 1, SPPF, [1024, 5]]       # 27
  # stream two
  - [24, 1, Conv, [1024, 3, 2]]    # 28
  - [-1, 3, C2f, [1024, True]]     # 29
  - [-1, 1, SPPF, [1024, 5]]       # 30
  # transformer fusion
  - [[27,30], 1, DSFFM, [1024]]    # 31
  - [[27,31], 1, Add2, [1024,0]]   # 32
  - [[30,31], 1, Add2, [1024,1]]   # 33

  ######### Add Block #############
  - [[9,10],  1, Add3, [1]]    # 34-P2/4 fusion backbone P2
  - [[16,17], 1, Add3, [1]]   # 35-P3/8 fusion backbone P3
  - [[23,24], 1, Add3, [1]]   # 36-P4/16 fusion backbone P4
  - [[32,33], 1, Add3, [1]]   # 37-P5/32 fusion backbone P5

# YOLOv8 head
head:
  - [[36, 35, 34], 1, MFFM, [256]] # 38

  - [-1, 1, Conv, [256, 3, 2]]             # 39
  - [[-1, 36], 1, Concat, [1]]             # 40
  - [-1, 3, C2f, [512]]                    # 41

  - [38, 1, nn.Upsample, [None, 2, 'nearest']] # 42
  - [[-1, 34], 1, Concat, [1]]                 # 43
  - [-1, 3, C2f, [256]]                        # 44

  - [[37, 41, 38], 1, MFFM, [256]] # 45

  - [-1, 1, Conv, [256, 3, 2]]             # 46
  - [[-1, 37], 1, Concat, [1]]             # 47
  - [-1, 3, C2f, [512]]                    # 48

  - [45, 1, nn.Upsample, [None, 2, 'nearest']] # 49
  - [[-1, 38], 1, Concat, [1]]                 # 50
  - [-1, 3, C2f, [256]]                        # 51

  - [[44, 48, 45, 51], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)